src/ex_Tabakon/DataProcessors/РМКУправляемыйРежим.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РМКУправляемыйРежим</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/СостоянияОднократныхСкидокИКупонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОднократныхСкидокИКупонов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОднократныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСкидки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ТБКДанныеВаучера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТБКДанныеВаучера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФамилияИмяОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСкидки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/Enums/ВариантыОбластейОграниченияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОбластейОграниченияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВДокументе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВСтроке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Enums/СостоянияОднократныхСкидок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияОднократныхСкидок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Активна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Применена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Documents/МаркетинговаяАкция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>МаркетинговаяАкция</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СкидкиНаценки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкидкаНаценка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Магазины</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Catalogs/СкидкиНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СкидкиНаценки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПредоставления</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбластейОграниченияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляемая</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ex_Tabakon/DataProcessors/РМКУправляемыйРежим/Forms/ТБКФормаВаучер/Ext/Form/Module.bsl
&НаКлиенте
Процедура КодПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	
	данныеВаучераПоКоду = ПолучитьВаучерПоКоду(ЭтаФорма.КодВаучера);
	Если данныеВаучераПоКоду <>  неопределено Тогда
		
		Элементы.Номинал.ТолькоПросмотр = Истина;
		Элементы.ФамилияИмяОтчество.ТолькоПросмотр = Истина;
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, данныеВаучераПоКоду, "ФамилияИмяОтчество, Номинал, Ваучер");
	Иначе
		Элементы.Номинал.ТолькоПросмотр = ложь;
		Элементы.ФамилияИмяОтчество.ТолькоПросмотр = ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВаучерПоКоду(кодВаучера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КупоныВаучеры.Скидка.ЗначениеСкидкиНаценки КАК Номинал,
	               |	ТБКДанныеВаучера.ФамилияИмяОтчество КАК ФамилияИмяОтчество,
	               |	КупоныВаучеры.Скидка КАК Ваучер
	               |ИЗ
	               |	РегистрСведений.СостоянияОднократныхСкидокИКупонов.СрезПоследних КАК КупоныВаучеры
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ТБКДанныеВаучера КАК ТБКДанныеВаучера
	               |		ПО КупоныВаучеры.ИдентификаторСкидки = ТБКДанныеВаучера.ИдентификаторСкидки
	               |ГДЕ
	               |	КупоныВаучеры.ИдентификаторСкидки = &кодВаучера";
	
	Запрос.УстановитьПараметр("кодВаучера",кодВаучера);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		
		возврат Новый Структура("Номинал,ФамилияИмяОтчество,Ваучер",рез.Номинал,рез.ФамилияИмяОтчество,рез.Ваучер);
	КонецЕсли;
	
КонецФУнкции


&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаСкидку(номинал, магазин)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкидкиНаценки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СкидкиНаценки КАК СкидкиНаценки
	               |ГДЕ
	               |	СкидкиНаценки.ОбластьПредоставления = &ОбластьПредоставления
	               |	И СкидкиНаценки.Управляемая = ИСТИНА
	               |	И СкидкиНаценки.ЗначениеСкидкиНаценки = &ЗначениеСкидкиНаценки
	               |	И СкидкиНаценки.ПометкаУдаления = ЛОЖЬ";
	
	ЗАпрос.УстановитьПараметр("ЗначениеСкидкиНаценки",номинал);
	ЗАпрос.УстановитьПараметр("ОбластьПредоставления",Перечисления.ВариантыОбластейОграниченияСкидокНаценок.ВСтроке);
	
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		ваучер = рез.Ссылка;
	Иначе
		Если номинал = 2000 Тогда
			ВызватьИсключение "Всегда должнабыть скидка [Ваучер 2000 рублей] с номиналом 2000";
		КонецЕсли;
		прототип = ПолучитьСсылкуНаСкидку(2000, магазин);
		Если ЛОЖЬ Тогда прототип = Справочники.СкидкиНаценки.ПустаяСсылка(); КонецЕсли;
		нОб = прототип.Скопировать();
		нОб.Наименование = "Ваучер "+Формат( номинал,"ЧГ=0")+" рублей";
		нОб.ЗначениеСкидкиНаценки = номинал;
		нОб.Записать();
		
		
		ваучер = нОб.Ссылка;		
	КонецЕсли;
		
	возврат ваучер;
КонецФУнкции

&НаСервереБезКонтекста
Функция ПроверкаДействияСкидки(магазин, скидка)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаркетинговаяАкцияСкидкиНаценки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.МаркетинговаяАкция.СкидкиНаценки КАК МаркетинговаяАкцияСкидкиНаценки
	               |ГДЕ
	               |	МаркетинговаяАкцияСкидкиНаценки.СкидкаНаценка = &скидка
	               |	//И МаркетинговаяАкцияСкидкиНаценки.Магазин = &магазин
				   | ORDER BY МаркетинговаяАкцияСкидкиНаценки.Ссылка.Дата DESC ";
	
	Запрос.УстановитьПараметр("магазин",магазин);
	Запрос.УстановитьПараметр("скидка",скидка);
	
	Если Запрос.Выполнить().Пустой() Тогда
		
		докВыборка = Документы.МаркетинговаяАкция.Выбрать();
		докВыборка.Следующий();
		
		док = докВыборка.Ссылка.ПолучитьОбъект();
		нстр = док.СкидкиНаценки.Добавить();
		нстр.ДатаНачала = док.Дата;
		//нстр.Магазин = магазин;
		нстр.СкидкаНаценка = скидка;
		
		//Если док.Магазины.Найти(магазин) = неопределено Тогда
		//	нстр = док.Магазины.Добавить();
		//	нстр.Магазин = магазин;
		//КонецЕсли;
		док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция СоздатьКупонВаучер(кодВаучера,фамилияИмяОтчество, ваучер, номинал ,магазин)
	НачатьТранзакцию();
	
	Если НЕ ЗначениеЗаполнено(ваучер) Тогда
		скидка = ПолучитьСсылкуНаСкидку(номинал,магазин);
	Иначе
		скидка = ваучер;
	КонецЕсли;
	
	нзВаучер = РегистрыСведений.СостоянияОднократныхСкидокИКупонов.СоздатьНаборЗаписей();
	нзВаучер.Отбор.ИдентификаторСкидки.Установить(кодВаучера,ИСТИНА);
	нзВаучер.Прочитать();
	Если нзВаучер.Количество() = 0 Тогда
		запись = нзВаучер.Добавить();
		
		запись.Период = НачалоДня(ТекущаяДата());
		запись.Состояние = Перечисления.СостоянияОднократныхСкидок.Активна ;
		запись.ИдентификаторСкидки = кодВаучера;
		запись.Скидка = скидка;
		нзВаучер.Записать(ложь);
		
		нзВаучерДанные = РегистрыСведений.ТБКДанныеВаучера.СоздатьНаборЗаписей();
		нзВаучерДанные.Отбор.ИдентификаторСкидки.Установить(кодВаучера);
		запись = нзВаучерДанные.Добавить();
		
		запись.ИдентификаторСкидки = кодВаучера;
		запись.ФамилияИмяОтчество = фамилияИмяОтчество;
		
		нзВаучерДанные.Записать(ложь);
	КонецЕсли;
	
	
	
	ЗафиксироватьТранзакцию();
	
	Возврат скидка;
КонецФункции


&НаКлиенте
Процедура ПрименитьСкидку(Команда)
	// Вставить содержимое обработчика.
	
	скидка = СоздатьКупонВаучер(ЭтаФорма.КодВаучера,ЭтаФорма.ФамилияИмяОтчество, ЭтаФорма.Ваучер, ЭтаФорма.Номинал, Магазин);
	ПроверкаДействияСкидки(магазин, скидка);
	
	МассивУправляемыхСкидок = новый Массив;
	МассивУправляемыхСкидок.Добавить(скидка);
	
	СписокОдноразовыхКодов = Новый СписокЗначений;
	СписокОдноразовыхКодов.Добавить(КодВаучера);
	
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("МассивУправляемыхСкидок" , МассивУправляемыхСкидок);
	СтруктураСтроки.Вставить("СписокОдноразовыхКодов", СписокОдноразовыхКодов);
	Закрыть(СтруктураСтроки)
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкидкиНаценки.Наименование КАК Наименование,
	               |	СкидкиНаценки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СкидкиНаценки КАК СкидкиНаценки
	               |ГДЕ
	               |	СкидкиНаценки.Наименование ПОДОБНО ""Ваучер%""";
	
	рез = Запрос.Выполнить().Выбрать();
	Пока рез.Следующий() Цикл
		ЭтаФорма.Элементы.Ваучер.СписокВыбора.Добавить(рез.Ссылка, рез.Наименование);
	КонецЦикла;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНаминалСкидка(скидка)
	Возврат скидка.ЗначениеСкидкиНаценки;
КонецФункции


&НаКлиенте
Процедура ВаучерПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЭтаФорма.Ваучер) Тогда
		Номинал = ПолучитьНаминалСкидка(ЭтаФорма.Ваучер);
	КонецЕсли;
КонецПроцедуры
